{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0005P3.py\u00da\b<lambda>\u00ae\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "border_mode": "valid", "nb_filter": 24, "activity_regularizer": null, "nb_row": 5, "bias": true, "nb_col": 5, "name": "convolution2d_1", "trainable": true, "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "border_mode": "valid", "nb_filter": 36, "activity_regularizer": null, "nb_row": 5, "bias": true, "nb_col": 5, "name": "convolution2d_2", "trainable": true, "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "border_mode": "valid", "nb_filter": 48, "activity_regularizer": null, "nb_row": 5, "bias": true, "nb_col": 5, "name": "convolution2d_3", "trainable": true, "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "bias": true, "nb_col": 3, "name": "convolution2d_4", "trainable": true, "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "bias": true, "nb_col": 3, "name": "convolution2d_5", "trainable": true, "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "input_dim": 1152, "bias": true, "name": "dense_1", "trainable": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 50, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "input_dim": 100, "bias": true, "name": "dense_2", "trainable": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "input_dim": 50, "bias": true, "name": "dense_3", "trainable": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "input_dim": 10, "bias": true, "name": "dense_4", "trainable": true, "W_constraint": null}}], "keras_version": "1.2.1"}